{
  "id": "garlic_001",
  "status": "Active",
  "plant": "Siberian Hardneck",
  "physical_location": "Loxahatchee, FL",
  "garden_location": "Panel 8",
  "full_sun_start": "9:45 AM EST",
  "full_shade_start": "3:30 PM EST",
  "container": "Window Box",
  "soil_mix": "Miracle-Gro Potting Mix",
  "origin_history": [
    "Vernalized the garlic for 6 weeks prior to planting.",
    "Planted in mid-November 2025 in black planter 23.5\" × 7.85\" × 6\" left section",
    "Shared with Music Hardneck, Chesnok Red Hardneck, and Scallions."
  ],
  "whats_been_logged": "The garlic has progressed from early emergence in acidic soil into stronger upright growth as lime buffering and moisture stability improved. Recently, the plants have shown stress from elevated salts/EC and high soil temperatures, with older outer leaves collapsing while green center growth and crown firmness remain the key recovery indicators.",
  "current_stage": "Early top growth (shoots 1–3 inches)",
  "current_state": "Several shoots show collapse and browning of older outer leaves while central growth remains green and upright. Leaf damage appears dry and papery rather than soft, and crowns remain intact with no visible signs of rot. Soil conditions are moderately moist but elevated salts/EC and high soil temperatures are contributing to visible stress, making crown firmness and continued green center growth the key indicators of recovery.",
  "timeline": [
    {
      "what_i_should_see": "Vernalization Complete",
      "date_range": "Sep 21 - Nov 15, 2025"
    },
    {
      "what_i_should_see": "First Green Tips Breaking Soil",
      "date_range": "Nov 16 - Nov 19, 2025"
    },
    {
      "what_i_should_see": "Upright Shoots & Elongating Leaves",
      "date_range": "Nov 20 - Dec 6, 2025"
    },
    {
      "what_i_should_see": "Multiple Leaves Emerging",
      "date_range": "Dec 7 - Dec 18, 2025"
    },
    {
      "what_i_should_see": "Tall Foliage & Dense Clumps",
      "date_range": "Dec 19, 2025 - Jan 10, 2026"
    },
    {
      "what_i_should_see": "Strap-Like Leaves Developing",
      "date_range": "Jan 11 - Feb 10, 2026"
    },
    {
      "what_i_should_see": "Tall Plants With Clustered Leaves",
      "date_range": "Feb 11 - Mar 10, 2026"
    },
    {
      "what_i_should_see": "Scapes Emerging & Curling",
      "date_range": "Mar 11 - May 1, 2026"
    },
    {
      "what_i_should_see": "Harvestable Scapes",
      "date_range": "May 10 - May 25, 2026"
    },
    {
      "what_i_should_see": "Ready to Harvest",
      "date_range": "May 26 - Jun 30, 2026"
    }
  ],
  "journal": [
    {
      "date": "12/28/2025",
      "time": "12:28 PM",
      "conditions": "Sunny with a high of 82°F dropping to 60°F overnight.",
      "digital_probe": {
        "ph": "6.40",
        "ec_mScm": "0.38",
        "salt_mg_L": "190",
        "moisture_mScm": "69.00",
        "light": "99",
        "rh_percent": "46",
        "fertility_percent": "22.0",
        "soil_temp_f": "86.9"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The Siberian Hardneck shoots show ongoing recovery with green central growth, while older tissue remains trimmed back from prior burn. A small amount of Miracle-Gro Moisture Control potting mix was added to fill and level a compressed probe area, then lightly watered to settle the soil, and mulch was replaced with a finer version for better soil shading. Soil remains quite moist and warm, consistent with the elevated moisture, salts, and temperature readings.",
      "actions": "Do not water tomorrow morning. Keep the mulch layer thin and evenly distributed while maintaining a 1–2 inch bare ring around each crown. Do not fertilize. Continue trimming only fully dead, crispy leaf tissue and avoid cutting into green sections.",
      "next_steps": "Take the next probe reading tomorrow afternoon. Resume watering only when moisture drops to approximately 40–45 mS/cm. If salts remain above 180–200 while moisture is high, continue holding water and prioritize dry-down and soil cooling; salt pressure should ease as the planter cycles toward a healthier moisture range.",
      "q_and_a_summary": "Discussed whether to water at 6:00 AM tomorrow; advised skipping watering because moisture and salts remain elevated and garlic benefits from dry-down before the next irrigation.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251228-02.jpeg",
          "caption": "Mulched soil surface around the Siberian Hardneck section showing thin, finer mulch coverage with garlic shoots remaining green and upright.",
          "tags": "garlic, siberian-hardneck, mulch, soil-surface, recovery"
        },
        {
          "file_name": "garlic_001-20251228-03.jpeg",
          "caption": "Close-up of the smaller garlic shoot near the front showing a green growth point and trimmed older tissue, with soil leveled where the probe previously compressed the surface.",
          "tags": "garlic, siberian-hardneck, close-up, small-shoot, recovery, soil-leveling"
        }
      ]
    },
    {
      "date": "12/27/2025",
      "time": "11:09 AM",
      "conditions": "Sunny with a high of 80°F dropping to 58°F overnight.",
      "digital_probe": {
        "ph": "6.40",
        "ec_mScm": "0.16",
        "salt_mg_L": "83",
        "moisture_mScm": "52.00",
        "light": "99",
        "rh_percent": "46",
        "fertility_percent": "8.0",
        "soil_temp_f": "79.3"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The Siberian Hardneck shoots show green central growth with older leaf tissue previously browned and burned. Mulch has been added across the soil surface to shade the root zone, and fully burned/browned tops have been trimmed off, leaving cleaner remaining green foliage. Crowns remain intact at the soil line with no visible signs of rot, and overall leaf posture appears lighter and more stable after trimming.",
      "actions": "Do not water tomorrow morning. Keep mulch in place at a thin, even layer while ensuring it does not touch the crowns. Do not fertilize. Continue trimming only fully dead, crispy leaf tissue and avoid cutting into green sections.",
      "next_steps": "Take the next probe reading tomorrow afternoon. Resume watering only when moisture drops to approximately 40–45 mS/cm. Continue monitoring for firm crowns and steady green center elongation; new growth should show reduced tip burn now that salts and soil temperature are improved.",
      "q_and_a_summary": "Reviewed mulch application and trimming of burned tops; confirmed both were appropriate and beneficial. Discussed whether to water at 6:00 AM tomorrow; advised skipping watering because moisture remains above the garlic watering trigger range.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251227-01.jpeg",
          "caption": "Before-trim close view showing older garlic leaves with dry, browned burn and some collapse while central growth remains green.",
          "tags": "garlic, siberian-hardneck, before, leaf-burn, stress, close-up"
        },
        {
          "file_name": "garlic_001-20251227-02.jpeg",
          "caption": "Before-trim wider view of the Siberian Hardneck section showing mixed leaf condition and exposure of the soil surface prior to mulching.",
          "tags": "garlic, siberian-hardneck, before, window-box, foliage, stress"
        },
        {
          "file_name": "garlic_001-20251227-03.jpeg",
          "caption": "After mulching view showing a thin mulch layer applied across the soil surface to shade and cool the root zone while keeping crowns exposed.",
          "tags": "garlic, siberian-hardneck, mulch, soil-surface, cooling, window-box"
        },
        {
          "file_name": "garlic_001-20251227-05.jpeg",
          "caption": "After-trim overhead view showing cleaned garlic shoots with trimmed browned tissue and mulch in place, highlighting intact crowns and remaining green growth.",
          "tags": "garlic, siberian-hardneck, after, trimmed, mulch, overhead"
        }
      ]
    },
    {
      "date": "12/26/2025",
      "time": "4:27 PM",
      "conditions": "Sunny with a high of 81°F dropping to 58°F overnight.",
      "digital_probe": {
        "ph": "6.20",
        "ec_mScm": "0.27",
        "salt_mg_L": "137",
        "moisture_mScm": "80.00",
        "light": "99",
        "rh_percent": "45",
        "fertility_percent": "15.0",
        "soil_temp_f": "89.1"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Several shoots show ongoing dry, papery browning on older leaves with some flopping and curling, while central growth remains green. Crowns appear intact at the soil line with no visible signs of rot. Soil remains very moist, consistent with the elevated moisture reading and daily morning watering pattern.",
      "actions": "Do not water tomorrow morning. Apply a 1/4–1/2 inch layer of mulch over the soil surface to reduce soil temperature, keeping mulch away from the crowns. Do not fertilize. Snip only leaves that are fully brown and crispy; leave any tissue that is still partially green.",
      "next_steps": "Take the next probe reading tomorrow afternoon and continue holding water unless moisture drops to approximately 40–45 mS/cm. If moisture remains above 55–60 mS/cm, skip watering again and prioritize airflow and soil cooling. Continue monitoring for firm crowns and stable green center growth as the main indicators of recovery.",
      "q_and_a_summary": "Discussed whether to water tomorrow morning given afternoon-only readings; advised skipping watering because moisture remains high, and confirmed mulch can be applied in the morning even without watering to help reduce soil temperature and ongoing stress.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251226-02.jpeg",
          "caption": "Planter view showing Siberian Hardneck shoots with mixed leaf condition, including older browned tissue and a curling/flopping leaf while central growth remains green.",
          "tags": "garlic, siberian-hardneck, leaf-browning, curling, stress, window-box"
        }
      ]
    },
    {
      "date": "12/25/2025",
      "time": "1:12 PM",
      "conditions": "Sunny with a high of 80°F dropping to 62°F overnight.",
      "digital_probe": {
        "ph": "5.70",
        "ec_mScm": "0.45",
        "salt_mg_L": "228",
        "moisture_mScm": "64.00",
        "light": "99",
        "rh_percent": "31",
        "fertility_percent": "27.0",
        "soil_temp_f": "88.9"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Several shoots show dry, papery browning on older leaf tops while central growth remains green. A few leaves are flopping from mid-leaf weakness, consistent with stress rather than rot. Crowns appear intact at the soil line, and the overall growth points remain active despite visible tip burn.",
      "actions": "Do not water today. Add a thin 1/4–1/2 inch layer of mulch over the soil surface to reduce soil temperature, keeping mulch away from the crowns. Snip only leaves that are fully brown and crispy; leave any leaf tissue that is still partially green.",
      "next_steps": "Recheck moisture and salts in 24–48 hours, ideally in the morning before full sun heats the soil. Resume watering only when moisture drops to approximately 40–45 mS/cm, and on the next watering apply water slowly until a small amount drains through to help reduce salt concentration. Continue watching for firm crowns and steady green center growth as the primary recovery indicators.",
      "q_and_a_summary": "Discussed whether the brown leaf tops are normal; confirmed this is typical older-leaf dieback from heat and elevated salts rather than disease or rot, and recommended cooling the soil and avoiding watering today.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251225-02.jpeg",
          "caption": "Wide view of the Siberian Hardneck section showing mixed leaf condition with some older leaves browning and one leaf flopping while other shoots remain upright and green.",
          "tags": "garlic, siberian-hardneck, leaf-browning, stress, window-box"
        },
        {
          "file_name": "garlic_001-20251225-03.jpeg",
          "caption": "Close-up of a garlic shoot showing a green central growth point with dry browning on older leaf tissue and intact crown at the soil line.",
          "tags": "garlic, siberian-hardneck, close-up, leaf-tip-burn, crown"
        }
      ]
    },
    {
      "date": "12/20/2025",
      "time": "7:54 AM",
      "conditions": "Sunny with a high of 82°F dropping to 66°F overnight.",
      "digital_probe": {
        "ph": "6.00",
        "ec_mScm": "0.44",
        "salt_mg_L": "220",
        "moisture_mScm": "100.00",
        "light": "99",
        "rh_percent": "63",
        "fertility_percent": "26.0",
        "soil_temp_f": "60.4"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Several garlic plants show yellowing and collapse of older outer leaves while inner leaves remain green and upright. Leaf damage appears dry and papery rather than soft, and crowns remain firm with no visible signs of rot. Soil conditions are saturated, consistent with elevated moisture and salt readings.",
      "actions": "Do not water. Avoid fertilization and bulb disturbance. Lightly loosen the top half-inch of soil between plants to improve aeration and confirm drainage openings are unobstructed.",
      "next_steps": "Allow soil to dry naturally over the next 24–48 hours. Take the next probe reading only after visible dry-down. Monitor for stabilization of leaf yellowing and continued firmness at the crown.",
      "q_and_a_summary": "Discussed whether the plant condition is concerning; confirmed stress is due to excess moisture and salts rather than disease or rot.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251220-02.jpeg",
          "caption": "Morning view of garlic plants showing yellowing and collapse of older outer leaves with green inner growth still present.",
          "tags": "garlic, leaf-yellowing, stress, early-growth"
        },
        {
          "file_name": "garlic_001-20251220-03.jpeg",
          "caption": "Close-up of soil surface and garlic crown showing saturated soil conditions and firm bulb base without signs of rot.",
          "tags": "garlic, crown, soil-moisture, inspection"
        },
        {
          "file_name": "garlic_001-20251220-04.jpeg",
          "caption": "Side view of a weakened garlic plant with outer leaf collapse while central growth remains upright.",
          "tags": "garlic, stress-response, foliage, window-box"
        }
      ]
    },
    {
      "date": "12/19/2025",
      "time": "10:17 AM",
      "conditions": "Patchy fog before 8 AM, otherwise partly sunny with a high near 84°F dropping to around 61°F overnight.",
      "digital_probe": {
        "ph": "5.90",
        "ec_mScm": "0.36",
        "salt_mg_L": "183",
        "moisture_mScm": "70.00",
        "light": "99",
        "rh_percent": "64",
        "fertility_percent": "21.0",
        "soil_temp_f": "73.8"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The garlic shows upright green central leaves with browning and necrosis on older leaf tips. Crowns appear firm with no signs of rot, while soil conditions are visibly moist. Stress symptoms are consistent with excess moisture and elevated salts rather than disease.",
      "actions": "Do not water today. Allow the soil to dry down naturally and avoid fertilization or amendments. Gently loosen the top half-inch of soil between plants to improve aeration without disturbing bulbs.",
      "next_steps": "Recheck moisture and salts once moisture drops below 45%. Resume watering only when soil approaches a moderate dry-down. Monitor leaf tips for stabilization rather than spread.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251220-02.jpeg",
          "caption": "Close-up view of garlic shoots showing upright green central leaves with browning on older leaf tips and firm crowns at the soil surface.",
          "tags": "garlic, leaf-tips, early-growth, stress"
        },
        {
          "file_name": "garlic_001-20251220-03.jpeg",
          "caption": "Side view of the window box showing spacing between garlic plants and visibly moist soil conditions.",
          "tags": "garlic, container, soil-moisture, window-box"
        },
        {
          "file_name": "garlic_001-20251220-04.jpeg",
          "caption": "Overhead view of multiple garlic plants with mixed leaf condition, highlighting healthy green centers and older damaged foliage.",
          "tags": "garlic, overhead, foliage, early-growth"
        }
      ]
    },
    {
      "date": "12/18/2025",
      "time": "12:56 PM",
      "conditions": "Partly sunny with a high of 83°F dropping to 67°F overnight.",
      "digital_probe": {
        "ph": "6.50",
        "ec_mScm": "0.24",
        "salt_mg_L": "123",
        "moisture_mScm": "60.00",
        "light": "98",
        "rh_percent": "53",
        "fertility_percent": "13.0",
        "soil_temp_f": "87.1"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Garlic plants show improved leaf posture with firmer, more upright leaves compared to earlier in the week. Bases remain thick and stable with no signs of collapse, narrowing, or yellowing. Soil remains moist from morning rain but shows improved structure and aeration, and no pooling or surface saturation is visible.",
      "actions": "Do not water or fertilize. Leave the planter exposed to sun and airflow to continue natural dry-down.",
      "next_steps": "Continue monitoring moisture and resume watering only when levels fall to approximately 40–45 mS/cm. Watch for continued leaf stiffening over the next 24 hours.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251218-02.jpeg",
          "caption": "Corner view showing garlic leaves standing more upright after soil moisture began to decline.",
          "tags": "garlic, siberian-hardneck, recovery, leaf-posture"
        },
        {
          "file_name": "garlic_001-20251218-03.jpeg",
          "caption": "Planter view highlighting stable plant bases and evenly moist but aerated soil following morning rain.",
          "tags": "garlic, siberian-hardneck, soil-condition, plant-base"
        }
      ]
    },
    {
      "date": "12/16/2025",
      "time": "11:56 AM",
      "conditions": "Mostly sunny with a high near 80°F dropping to around 65°F overnight.",
      "digital_probe": {
        "ph": "6.10",
        "ec_mScm": "0.25",
        "salt_mg_L": "126",
        "moisture_mScm": "90.00",
        "light": "86",
        "rh_percent": "50",
        "fertility_percent": "13.0",
        "soil_temp_f": "78.4"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Garlic plants remain upright at the base but show softer leaf posture and gentle downward curvature compared to prior days, indicating a response to saturated soil conditions. Leaf color remains green with no yellowing, collapse, or narrowing at the stem bases. Cut leaf stubs remain dry and sealed, and no signs of rot or disease are present. Soil is visibly saturated following repeated rain events.",
      "actions": "Do not water or fertilize. Leave the planter undisturbed and fully exposed to sun and wind to encourage oxygen return to the root zone.",
      "next_steps": "Recheck moisture once levels fall below approximately 60 mS/cm and observe for improved leaf firmness. Resume normal watering only when moisture reaches around 40–45 mS/cm.",
      "q_and_a_summary": "Discussed visible differences in leaf posture compared to previous days; confirmed changes reflect temporary saturation response rather than plant stress or disease.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251216-02.jpeg",
          "caption": "Overhead view showing slightly relaxed leaf posture while bases remain upright and stable.",
          "tags": "garlic, siberian-hardneck, leaf-posture, moisture-response"
        },
        {
          "file_name": "garlic_001-20251216-03.jpeg",
          "caption": "Side view highlighting gentle leaf curvature without collapse or yellowing.",
          "tags": "garlic, siberian-hardneck, foliage, saturation"
        },
        {
          "file_name": "garlic_001-20251216-04.jpeg",
          "caption": "Planter view showing saturated soil surface and intact, firm garlic bases.",
          "tags": "garlic, siberian-hardneck, soil-moisture, plant-base"
        },
        {
          "file_name": "garlic_001-20251216-05.jpeg",
          "caption": "Close-up showing healthy green leaves and dry, sealed cut stubs with no rot.",
          "tags": "garlic, siberian-hardneck, cut-stubs, healthy-growth"
        }
      ]
    },
    {
      "date": "12/15/2025",
      "time": "10:37 AM",
      "conditions": "A 20 percent chance of showers and thunderstorms, partly sunny with a high of 81°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "7.00",
        "ec_mScm": "0.29",
        "salt_mg_L": "146",
        "moisture_mScm": "70.00",
        "light": "94",
        "rh_percent": "40",
        "fertility_percent": "16.0",
        "soil_temp_f": "70.0"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Garlic plants remain upright and firmly anchored with stable leaf height and count compared to the previous day. Outer leaf tips show minor, unchanged browning while central leaves remain green and firm. Soil is visibly wetter following rain and the addition of fresh potting mix to fill probe holes, but no signs of collapse, rot, or stress are present.",
      "actions": "Do not water or fertilize. Allow soil to dry naturally with sun and wind exposure.",
      "next_steps": "Recheck moisture once levels fall below approximately 55 mS/cm. Resume normal watering only when moisture reaches around 40 mS/cm.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251215-02.jpeg",
          "caption": "Overhead view showing upright garlic plants with stable leaf structure and moist soil following rain.",
          "tags": "garlic, siberian-hardneck, overhead, soil-moisture"
        },
        {
          "file_name": "garlic_001-20251215-03.jpeg",
          "caption": "Corner view highlighting leaf posture and fresh potting mix added to even out the soil surface.",
          "tags": "garlic, siberian-hardneck, soil-surface, early-growth"
        },
        {
          "file_name": "garlic_001-20251215-04.jpeg",
          "caption": "Close view showing healthy central leaves and dry, sealed cut leaf stubs with no signs of rot.",
          "tags": "garlic, siberian-hardneck, plant-base, foliage"
        }
      ]
    },
    {
      "date": "12/14/2025",
      "time": "2:36 PM",
      "conditions": "Showers likely with a high of 81°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "6.20",
        "ec_mScm": "0.15",
        "salt_mg_L": "77",
        "moisture_mScm": "53.00",
        "light": "99",
        "rh_percent": "52",
        "fertility_percent": "8.0",
        "soil_temp_f": "85.5"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Garlic plants are upright and firmly established with multiple leaves per plant and noticeably thicker bases at the soil line. Outer leaves show minor, stable tip browning with no progression, while central leaves are green and actively elongating. Cut leaf stubs appear dry and sealed with no signs of rot or collapse. Soil moisture has returned to an ideal mid-range and structure appears cohesive but aerated.",
      "actions": "Do not water or fertilize. Leave foliage intact and allow incoming rain to provide natural hydration.",
      "next_steps": "Recheck moisture after rain passes and resume watering only if levels fall below approximately 40 mS/cm. Continue monitoring leaf elongation and base thickening over the next week.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251214-02.jpeg",
          "caption": "Overhead view showing upright garlic shoots with multiple leaves and evenly moist soil.",
          "tags": "garlic, siberian-hardneck, overhead, foliage"
        },
        {
          "file_name": "garlic_001-20251214-03.jpeg",
          "caption": "Corner view highlighting established plants with stable outer-leaf tip browning and firm bases.",
          "tags": "garlic, siberian-hardneck, soil-condition, leaf-tips"
        },
        {
          "file_name": "garlic_001-20251214-04.jpeg",
          "caption": "Close side view showing strong central leaves and dry, sealed cut leaf stubs with no rot.",
          "tags": "garlic, siberian-hardneck, early-growth, plant-base"
        }
      ]
    },
    {
      "date": "12/12/2025",
      "time": "1:17 PM",
      "conditions": "Mostly sunny with a high of 79°F dropping to 62°F overnight.",
      "digital_probe": {
        "ph": "6.00",
        "ec_mScm": "0.27",
        "salt_mg_L": "137",
        "moisture_mScm": "100.00",
        "light": "99",
        "rh_percent": "37",
        "fertility_percent": "15.0",
        "soil_temp_f": "83.8"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Garlic plants are upright and actively growing with strong central leaves and healthy green coloration. Outer leaves show minor, stable tip browning consistent with earlier moisture fluctuations, while cut leaf stubs appear dry and clean with no signs of rot. Soil is fully saturated and cohesive throughout the planter, explaining the maximum moisture reading. Overall plant vigor remains strong with no visible stress.",
      "actions": "Do not water or fertilize. Allow the soil to dry naturally and keep the surface undisturbed to encourage even moisture reduction.",
      "next_steps": "Recheck moisture in 24–48 hours and resume watering only once levels fall below approximately 45 mS/cm. Continue monitoring center-leaf posture and elongation for steady growth.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251212-02.jpeg",
          "caption": "Overhead view showing upright Siberian Hardneck shoots and fully saturated, dark soil.",
          "tags": "garlic, siberian-hardneck, overhead, soil-moisture"
        },
        {
          "file_name": "garlic_001-20251212-03.jpeg",
          "caption": "Corner view of the planter showing cohesive, wet soil and healthy garlic foliage with minor tip browning.",
          "tags": "garlic, siberian-hardneck, soil-condition, foliage"
        },
        {
          "file_name": "garlic_001-20251212-04.jpeg",
          "caption": "Side view highlighting strong central leaf growth and clean, dry cut leaf stubs with no signs of rot.",
          "tags": "garlic, siberian-hardneck, foliage, early-growth"
        }
      ]
    },
    {
      "date": "12/11/2025",
      "time": "4:54 PM",
      "conditions": "Mostly Sunny with a high of 73°F dropping to 53°F overnight.",
      "digital_probe": {
        "ph": "6.60",
        "ec_mScm": "0.44",
        "salt_mg_L": "222",
        "moisture_mScm": "80.00",
        "light": "96",
        "rh_percent": "50",
        "fertility_percent": "26.0",
        "soil_temp_f": "73.2"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Garlic plants remain upright with actively elongating center leaves and healthy green coloration. Older leaves continue to show stable tip browning from earlier stress, with no progression or signs of disease. Soil is very moist and cohesive following recent rain and amendment, explaining the elevated moisture, EC, and salt readings. Overall plant condition remains strong with no visual indicators of rot, wilt, or decline.",
      "actions": "Do not water or fertilize. Allow the soil to dry naturally and avoid disturbing the amended surface.",
      "next_steps": "Monitor moisture over the next 24–48 hours as it dries back toward the mid-range. Resume watering only once moisture approaches 40–45 mS/cm. Continue watching center-leaf posture and elongation for signs of steady growth.",
      "q_and_a_summary": "Discussed whether current temperatures pose a risk; confirmed that short-term daytime warmth with cool nights is safe for garlic and not a cause for concern.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "garlic_001-20251211-02.jpeg",
          "caption": "Overhead view showing upright garlic shoots and evenly moist soil following recent rainfall.",
          "tags": "garlic, siberian-hardneck, overhead, soil-moisture"
        },
        {
          "file_name": "garlic_001-20251211-03.jpeg",
          "caption": "Side view highlighting healthy center-leaf growth and stable older leaf tip browning.",
          "tags": "garlic, siberian-hardneck, foliage, leaf-tips"
        },
        {
          "file_name": "garlic_001-20251211-04.jpeg",
          "caption": "Planter edge view showing cohesive, wet soil and intact garlic bases with no signs of rot.",
          "tags": "garlic, siberian-hardneck, soil-condition, plant-base"
        }
      ]
    },
    {
      "date": "12/10/2025",
      "time": "8:45 AM",
      "conditions": "Mostly Sunny with a high of 77°F dropping to 52°F overnight.",
      "digital_probe": {
        "ph": "6.30",
        "ec_mScm": "0.19",
        "salt_mg_L": "96",
        "moisture_mScm": "56.00",
        "light": "83",
        "rh_percent": "64",
        "fertility_percent": "10.0",
        "soil_temp_f": "63.9"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Garlic shoots remain upright and vigorous with bright green new leaves emerging cleanly from each clove. Older, previously damaged leaves show stable tip browning and tearing consistent with earlier mechanical stress, but no signs of disease or nutrient imbalance. Soil structure appears noticeably improved from yesterday’s amendment, showing better aeration and consistent moisture retention. Overall plant condition is strong with continued top growth and healthy color.",
      "actions": "Do not water today as moisture is ideal and weather conditions are mild. Leave all foliage intact and allow the amended soil to continue settling without further disturbance.",
      "next_steps": "Recheck moisture tomorrow morning as the soil gradually dries. Resume watering once levels fall toward 40 mS/cm. Continue monitoring for increasing leaf height and base thickening over the next several days.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Morning probe reading showing ideal pH and moderate moisture following improved soil aeration.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Planter view with upright garlic foliage and amended soil displaying improved structure.",
          "tags": "garlic, siberian-hardneck, foliage, soil-condition"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Side angle showing stable older leaf damage and healthy emerging center growth.",
          "tags": "garlic, siberian-hardneck, leaf-tip, early-growth"
        }
      ]
    },
    {
      "date": "12/9/2025",
      "time": "7:47 AM",
      "conditions": "Slight Chance T-storms then Showers Likely with a high of 83°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "5.97",
        "ec_mScm": "0.13",
        "salt_mg_L": "67",
        "moisture_mScm": "51.00",
        "light": "83",
        "rh_percent": "56",
        "fertility_percent": "6.5",
        "soil_temp_f": "65.7"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Garlic shoots remain upright and vigorous with healthy, glossy new leaves emerging from each clove. Older leaves show minor tearing and browned tips consistent with mechanical damage from earlier handling, soil abrasion, or wind, but no signs of disease or nutrient imbalance are present. Soil structure has improved noticeably after adding Miracle-Gro Moisture Control Potting Mix, resulting in better aeration and more reliable probe contact. Moisture sits at an ideal mid-range level following recent rain.",
      "actions": "Do not water today, as moisture is ideal and additional showers are expected. Leave all foliage intact and allow the amended soil to settle naturally without further disturbance.",
      "next_steps": "Recheck moisture tomorrow once rainfall has passed. Resume watering only when readings fall toward 40 mS/cm. Continue monitoring for steady center-leaf elongation and strengthening of the plant bases over the next several days.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading showing ideal pH, moderate moisture, and stable nutrient levels following minor soil amendment.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Planter view with upright garlic foliage and improved soil aeration after adding Moisture Control potting mix.",
          "tags": "garlic, siberian-hardneck, planter, soil-aeration"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Side view showing healthy new leaves alongside older mechanically damaged leaf tips.",
          "tags": "garlic, siberian-hardneck, foliage, leaf-tip"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Close-up of developing garlic shoots with firm central growth and freshly loosened soil.",
          "tags": "garlic, siberian-hardneck, new-growth, soil-condition"
        }
      ]
    },
    {
      "date": "12/8/2025",
      "time": "10:54 AM",
      "conditions": "Slight Chance T-storms then Showers Likely with a high of 83°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "5.76",
        "ec_mScm": "0.27",
        "salt_mg_L": "137",
        "moisture_mScm": "62.00",
        "light": "94",
        "rh_percent": "63",
        "fertility_percent": "14.7",
        "soil_temp_f": "77.2"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Garlic shoots remain upright, green, and actively elongating with healthy new foliage emerging from each plant. Several leaves display minor tip browning consistent with earlier dry-to-wet swings and normal mechanical wear, but the central growth points are strong and vibrant. Soil structure appears well-aerated with moderate moisture following prior hydration, and no signs of disease, wilt, or nutrient stress are present.",
      "actions": "Do not water today, as incoming rainfall will supply additional moisture. Leave all foliage intact and avoid lime or fertilizer at this time.",
      "next_steps": "Recheck moisture after rainfall passes tomorrow. Resume watering only when moisture readings decline toward 40–50 mS/cm. Continue monitoring for steady leaf emergence and overall shoot thickening.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading showing stable pH, moderate moisture, and healthy nutrient levels before expected rainfall.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Mid-planter view showing upright garlic foliage and minor tip browning consistent with normal early growth.",
          "tags": "garlic, siberian-hardneck, foliage, early-growth"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Side view of a garlic plant with mild tip browning and healthy central leaf emergence.",
          "tags": "garlic, siberian-hardneck, leaf-tip, early-growth"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Close-up of actively growing garlic foliage with green, firm new leaves emerging from the center.",
          "tags": "garlic, siberian-hardneck, new-growth, foliage"
        }
      ]
    },
    {
      "date": "12/7/2025",
      "time": "12:41 PM",
      "conditions": "Sunny with a high near 86°F, patchy fog early, calm to light south wind. Overnight low around 66°F.",
      "digital_probe": {
        "ph": "5.77",
        "ec_mScm": "0.22",
        "salt_mg_L": "112",
        "moisture_mScm": "90.00",
        "light": "94",
        "rh_percent": "52",
        "fertility_percent": "11.3",
        "soil_temp_f": "92.3"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Soil is very moist, confirmed both by probe moisture of 90 mS/cm and visual inspection showing uniformly dark, hydrated soil with no signs of crusting. Shoots are upright, turgid, and healthy, including the younger leaf clusters. No indicators of dehydration or nutrient imbalance. Soil texture appears stable after recent watering, and the new growth remains vibrant.",
      "actions": "Do not water today. Soil moisture is significantly above the safe hydration threshold, and additional water would risk oversaturation.",
      "next_steps": "Recheck moisture tomorrow morning or the following day. Resume watering only when moisture levels fall back toward 40 mS/cm. Continue monitoring shoot growth and soil drying rate under sunny conditions.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading after soil hydration showing elevated moisture and stable pH.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Planter view showing moist soil and healthy upright garlic foliage in strong midday sun.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil-condition"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Close-up of young garlic shoot developing well in fully hydrated soil.",
          "tags": "garlic, siberian-hardneck, new-shoot, sprout"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Additional angle showing overall foliage vigor and wet soil surface after watering.",
          "tags": "garlic, siberian-hardneck, foliage, soil-moisture"
        }
      ]
    },
    {
      "date": "12/4/2025",
      "time": "4:52 PM",
      "conditions": "Mostly sunny with a high of 84°F dropping to 64°F overnight.",
      "digital_probe": {
        "ph": "5.77",
        "ec_mScm": "0.20",
        "salt_mg_L": "101",
        "moisture_mScm": "57.00",
        "light": "58",
        "rh_percent": "52",
        "fertility_percent": "10.0",
        "soil_temp_f": "81.1"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "After the soil became bone dry earlier in the afternoon, hydration restored the planter to a stable and healthy condition. Shoots remain upright and vigorous with deep green coloration. The newly emerging shoot continues to grow normally, and the previously curled leaf shows improved straightening. Soil appears evenly moist without pooling, and overall plant health is excellent.",
      "actions": "No watering or amendments needed for the remainder of the day.",
      "next_steps": "Recheck moisture tomorrow and resume watering once values fall back near 40 mS/cm. Continue monitoring shoot growth and hydration stability.",
      "q_and_a_summary": "",
      "follow_up": [
        "[2:05 PM] Watered due to extremely dry soil preventing probe readings."
      ],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading showing stable pH and rehydrated soil following mid-afternoon watering.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Garlic shoots displaying strong upright growth and well-hydrated soil after earlier dryness.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Close-up of young garlic shoot continuing normal development in freshly rehydrated soil.",
          "tags": "garlic, siberian-hardneck, new-shoot, sprout"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Additional angle showing foliage health and improved soil moisture distribution.",
          "tags": "garlic, siberian-hardneck, foliage, soil-condition"
        }
      ]
    },
    {
      "date": "12/3/2025",
      "time": "1:36 PM",
      "conditions": "Mostly sunny with a high of 82°F dropping to 62°F overnight.",
      "digital_probe": {
        "ph": "7.83",
        "ec_mScm": "0.14",
        "salt_mg_L": "74",
        "moisture_mScm": "39.00",
        "light": "99",
        "rh_percent": "51",
        "fertility_percent": "7.0",
        "soil_temp_f": "90.3"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Shoots remain upright, green, and healthy with no signs of wilt despite the soil being noticeably dry. The previously curled leaf continues to relax, and the newest small shoot is growing normally. Soil texture and color indicate substantial drying since the last watering.",
      "actions": "Apply 1/4 cup of water around the base of each garlic shoot, poured slowly to prevent channeling. Do not add any amendments.",
      "next_steps": "Recheck moisture and pH tomorrow; values should normalize after today's light irrigation. Continue monitoring shoot growth and soil hydration.",
      "q_and_a_summary": "",
      "follow_up": [
        "[1:50 PM] Added 1/4 cup of water around each garlic shoot as instructed."
      ],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading indicating low moisture and a temporarily elevated pH due to dry soil conditions.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Garlic shoots showing strong upright growth under sunny conditions with visibly dry soil.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Close-up of the newest garlic shoot developing well despite drier soil.",
          "tags": "garlic, siberian-hardneck, new-shoot, sprout"
        }
      ]
    },
    {
      "date": "12/2/2025",
      "time": "10:47 AM",
      "conditions": "Partly sunny with temperatures in the mid 70s°F and overnight lows near 69°F.",
      "digital_probe": {
        "ph": "6.17",
        "ec_mScm": "0.31",
        "salt_mg_L": "156",
        "moisture_mScm": "70.00",
        "light": "99",
        "rh_percent": "61",
        "fertility_percent": "17.3",
        "soil_temp_f": "75.6"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Shoots remain upright and vigorous with steady elongation and healthy green color. The newly emerging shoot is developing normally, and the soil appears evenly moist and well-aerated. No signs of stress, yellowing, or deformation are present.",
      "actions": "Do not water today; moisture remains elevated. No amendments are needed.",
      "next_steps": "Recheck moisture tomorrow and resume watering when values fall below roughly 40 mS/cm. Continue monitoring new shoot development and overall foliage stability.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading showing stable pH and elevated moisture after recent hydration.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Garlic shoots displaying strong upright growth with healthy color in well-aerated soil.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Close-up of the young newly emerged garlic shoot developing normally beside older foliage.",
          "tags": "garlic, siberian-hardneck, new-shoot, sprout"
        }
      ]
    },
    {
      "date": "11/28/2025",
      "time": "10:34 AM",
      "conditions": "Cloudy with a high of 72°F dropping to 57°F overnight. Clear conditions expected around 6:00 PM.",
      "digital_probe": {
        "ph": "5.12",
        "ec_mScm": "0.20",
        "salt_mg_L": "102",
        "moisture_mScm": "48.00",
        "light": "97",
        "rh_percent": "52",
        "fertility_percent": "10.0",
        "soil_temp_f": "63.3"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Shoots remain upright and vigorous with healthy color and consistent elongation. Soil is evenly moist and well-aerated following recent rain, with no signs of stress or compaction. All foliage, including the previously curled leaf, continues stable development.",
      "actions": "Do not water today. No amendments are needed.",
      "next_steps": "Recheck moisture tomorrow and plan the next watering once values fall below approximately 40 mS/cm. Continue monitoring shoot height and overall stability.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading showing ideal moisture and stable pH in cool morning conditions.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck shoots displaying healthy vertical growth and evenly hydrated soil.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil"
        }
      ]
    },
    {
      "date": "11/27/2025",
      "time": "11:18 AM",
      "conditions": "Cloudy with a high of 81°F dropping to 65°F overnight. Rain expected around 6:00 PM.",
      "digital_probe": {
        "ph": "5.17",
        "ec_mScm": "0.56",
        "salt_mg_L": "281",
        "moisture_mScm": "66.00",
        "light": "98",
        "rh_percent": "67",
        "fertility_percent": "34.0",
        "soil_temp_f": "80.8"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Shoots remain upright, vigorous, and well-colored with a newly emerged sprout showing healthy development. Soil is well-hydrated and evenly textured after recent storms and added mix, with no pooling or compaction issues. Overall plant condition is strong with stable early top growth.",
      "actions": "Do not water today. No amendments are needed.",
      "next_steps": "Allow incoming rain to provide natural hydration. Recheck moisture tomorrow and plan the next watering once values fall below approximately 40 mS/cm.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading showing ideal pH and elevated moisture following recent rainfall and soil adjustments.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck shoots showing strong vertical growth and healthy color in well-aerated soil.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Close-up of a newly emerged garlic shoot indicating ongoing active growth.",
          "tags": "garlic, siberian-hardneck, new-shoot, sprout"
        }
      ]
    },
    {
      "date": "11/26/2025",
      "time": "10:50 AM",
      "conditions": "Mostly cloudy with a high of 84°F dropping to 67°F overnight. Thunderstorms expected around 4:00 PM.",
      "digital_probe": {
        "ph": "5.37",
        "ec_mScm": "0.30",
        "salt_mg_L": "151",
        "moisture_mScm": "70.00",
        "light": "99",
        "rh_percent": "63",
        "fertility_percent": "16.7",
        "soil_temp_f": "79.9"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Shoots are upright, elongated, and stable with no signs of stress. Soil is well-hydrated from yesterday's watering and this morning's light rain, and texture remains airy and well-draining. Foliage color and structure are healthy, including the curved leaf which continues to relax naturally.",
      "actions": "Do not water today. Do not add any amendments.",
      "next_steps": "Allow incoming storms to provide natural hydration. Recheck moisture tomorrow and resume watering only after levels fall below approximately 40 mS/cm.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading taken before midday rain showing stable pH and elevated moisture.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck shoots showing strong upright growth and evenly hydrated soil.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil"
        }
      ]
    },
    {
      "date": "11/25/2025",
      "time": "3:00 PM",
      "conditions": "Sunny all day with a high of 84°F dropping to 65°F overnight.",
      "digital_probe": {
        "ph": "5.44",
        "ec_mScm": "0.35",
        "salt_mg_L": "176",
        "moisture_mScm": "70.00",
        "light": "99",
        "rh_percent": "45",
        "fertility_percent": "20.0",
        "soil_temp_f": "84.0"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Shoots are upright, vigorous, and elongating well with no signs of stress. Soil is fully hydrated after the afternoon watering and remains well-aerated. Foliage color and structure appear stable and healthy.",
      "actions": "No further watering or amendments needed today.",
      "next_steps": "Recheck moisture and pH tomorrow as the soil settles after watering. Continue monitoring early foliage growth.",
      "q_and_a_summary": "",
      "follow_up": [
        "[2:33 PM] Watered lightly due to missing the morning watering window."
      ],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading taken 1.5 hours after watering, showing ideal pH and expected elevated moisture.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck shoots with strong upright growth and evenly hydrated soil.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil"
        }
      ]
    },
    {
      "date": "11/24/2025",
      "time": "11:31 AM",
      "conditions": "Partly cloudy with a high of 81°F dropping to 61°F overnight.",
      "digital_probe": {
        "ph": "7.73",
        "ec_mScm": "0.41",
        "salt_mg_L": "209",
        "moisture_mScm": "66.00",
        "light": "93",
        "rh_percent": "57",
        "fertility_percent": "24.0",
        "soil_temp_f": "79.5"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Shoots remained upright and hydrated with no stress despite the temporary pH spike. Soil texture was healthy and aerated following the watering, and foliage condition was stable.",
      "actions": "No amendments needed. Allow the soil pH and moisture to redistribute naturally.",
      "next_steps": "Recheck moisture and pH the following day to monitor settling after watering.",
      "q_and_a_summary": "",
      "follow_up": [
        "[11:00 AM] Lightly watered due to very dry and crumbly soil."
      ],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Probe reading taken shortly after watering, showing a temporary elevated pH and increased moisture.",
          "tags": "garlic, siberian-hardneck, probe, soil-data"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck shoots standing firm with healthy hydration and stable leaf structure.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil"
        }
      ]
    },
    {
      "date": "11/23/2025",
      "time": "1:27 PM",
      "conditions": "Sunny with a high of 84°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "6.28",
        "ec_mScm": "0.19",
        "salt_mg_L": "96",
        "moisture_mScm": "33.00",
        "light": "99",
        "rh_percent": "48",
        "fertility_percent": "9.5",
        "soil_temp_f": "92.1"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Siberian Hardneck shoots remain strong, upright, and well-hydrated, with continued elongation of the central shoot and stable growth from all cloves. Soil pH has stabilized in the ideal garlic range at 6.28, indicating successful lime buffering throughout the planter depth. Soil surface dryness aligns with the moisture reading of 33 mS/cm, showing the planter is ready for light watering. No signs of stress, tip burn, yellowing, or fungal issues are present, and overall plant vigor is excellent.",
      "actions": "Apply a light watering of approximately 1/4 cup around the base to maintain even moisture. Do not add lime or fertilizer today.",
      "next_steps": "Recheck moisture and pH tomorrow to confirm stable soil hydration and continued healthy pH levels. Continue monitoring shoot elongation and early foliage development.",
      "q_and_a_summary": "",
      "follow_up": [
        "[1:33 PM] Added 1/4 cup of water around the base to maintain even moisture."
      ],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck sprouts with upright, strengthening foliage and drier surface soil indicating readiness for light watering.",
          "tags": "garlic, siberian-hardneck, sprouts, planter, soil"
        }
      ]
    },
    {
      "date": "11/22/2025",
      "time": "10:50 AM",
      "conditions": "Mostly cloudy with a high of 84°F dropping to 67°F overnight.",
      "digital_probe": {
        "ph": "4.85",
        "ec_mScm": "0.34",
        "salt_mg_L": "171",
        "moisture_mScm": "41.00",
        "light": "98",
        "rh_percent": "50",
        "fertility_percent": "19.3",
        "soil_temp_f": "78.6"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Siberian Hardneck shoots remain upright, plump, and healthy with no signs of stress. Soil moisture is stable and well-balanced, and surface dryness does not reflect the strong internal moisture reading. The pH dip to 4.85 is consistent with lime dissolving unevenly through soil layers and does not indicate a true setback. Lime residue remains visible on the surface, confirming ongoing buffering. Overall growth is steady, and the shoot in the upper-right corner appears consistent with Music Hardneck rather than Siberian based on thickness and position.",
      "actions": "Do not water today, as moisture levels are ideal. Do not add lime, as buffering is still in progress. Avoid fertilizing until shoots reach 6–8 inches.",
      "next_steps": "Recheck pH and moisture in 24 hours to confirm continued buffering. Monitor ongoing shoot elongation and foliage development. Resume watering only when moisture drops below approximately 30 mS/cm.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck row with upright shoots and visible lime dissolving on the soil surface.",
          "tags": "garlic, siberian-hardneck, sprouts, lime, planter"
        }
      ]
    },
    {
      "date": "11/21/2025",
      "time": "3:26 PM",
      "conditions": "Sunny with a high of 84°F dropping to 60°F overnight.",
      "digital_probe": {
        "ph": "5.33",
        "ec_mScm": "0.25",
        "salt_mg_L": "129",
        "moisture_mScm": "42.00",
        "light": "99",
        "rh_percent": "49",
        "fertility_percent": "13.3",
        "soil_temp_f": "80.1"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Siberian Hardneck shoots appear healthy, upright, and strengthening, with several sprouts showing continued elongation. Soil moisture is now in an optimal range compared to earlier dryness, and remaining visible lime on the surface indicates ongoing pH buffering. The pH trend shows consistent improvement from the low 4s to 5.33, confirming that the lime is dissolving effectively. No signs of stress, discoloration, or deformity are present. Light exposure is excellent and the planter conditions are stable.",
      "actions": "No watering needed at this moment as moisture is well-balanced. Do not apply any more lime today since pH is rising steadily. Maintain full sun exposure and avoid fertilizer at this early growth stage.",
      "next_steps": "Recheck pH and moisture in 24 hours to confirm continued upward pH movement. Monitor for additional shoot emergence and early foliage extension. Hold off on fertilizing until shoots reach the 6–8 inch stage to avoid early nutrient burn.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck shoots standing firm with visible lime dissolving on the soil surface.",
          "tags": "garlic, siberian-hardneck, sprouts, lime, planter"
        }
      ]
    },
    {
      "date": "11/20/2025",
      "time": "12:23 PM",
      "conditions": "Mostly sunny with a high of 83°F dropping to 64°F overnight.",
      "digital_probe": {
        "ph": "4.65",
        "ec_mScm": "0.20",
        "salt_mg_L": "104",
        "moisture_mScm": "8.00",
        "light": "91",
        "rh_percent": "65",
        "fertility_percent": "10.0",
        "soil_temp_f": "85.3"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Multiple healthy garlic shoots are present, including a new sprout emerging from the lower-left area of the box. Early growth appears strong with green, firm shoots. Soil is very dry at 8.0 mS/cm, and surface texture shows loose, dry conditions with visible lime still dissolving. The scallion relocation improved spacing and did not disturb the garlic. pH is low at 4.65, but existing lime is still dissolving and gradually buffering the soil. No signs of disease or stress.",
      "actions": "Apply a light, even watering to rehydrate the upper soil layer and help dissolve remaining lime. Do not add more lime today. No fertilizer needed at this stage. Maintain full sun exposure.",
      "next_steps": "Recheck moisture and pH in 24 hours. Monitor additional shoots emerging over the next week. If pH remains below 5.5 after lime dissolves and soil rehydrates, apply a small follow-up lime dose. Continue avoiding fertilizer until leaves reach 6–8 inches.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "New Siberian Hardneck shoot emerging with very dry soil surface and visible lime residue.",
          "tags": "garlic, hardneck, siberian-hardneck, sprouting, lime, soil-moisture-low"
        }
      ]
    },
    {
      "date": "11/19/2025",
      "time": "9:29 AM",
      "conditions": "Mostly sunny with a high around 82–85°F dropping to 64°F overnight.",
      "digital_probe": {
        "ph": "4.48",
        "ec_mScm": "0.02",
        "salt_mg_L": "13",
        "moisture_mScm": "0.00",
        "light": "98",
        "rh_percent": "65",
        "fertility_percent": "1.0",
        "soil_temp_f": "71.2"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Early Siberian Hardneck shoots remain upright, green, and vigorous despite low pH and very low measured moisture at probe depth. Surface soil looks drier but plants do not show wilting or tip burn.",
      "actions": "Apply a measured top-dress of garden lime across the planter section for pH correction and water lightly afterward to help it begin dissolving.",
      "next_steps": "Recheck pH and moisture the following morning and continue monitoring shoot elongation and any signs of stress as pH slowly rises.",
      "q_and_a_summary": "",
      "follow_up": [
        "[11:07 AM] Soil was watered unexpectedly; confirmed lime can still be applied safely to moist soil as long as it is not piled directly against stems.",
        "[3:04 PM] Applied lime across the garlic and scallion planter after earlier watering to begin raising soil pH."
      ],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck row with healthy green shoots on the left side of the planter.",
          "tags": "garlic, siberian-hardneck, shoots, planter"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Whole planter after lime application across Siberian Hardneck, Music, Chesnok Red, and scallions.",
          "tags": "garlic, scallions, lime, planter, ph-correction"
        }
      ]
    },
    {
      "date": "11/18/2025",
      "time": "8:52 AM",
      "conditions": "Partly cloudy with a high of 82°F dropping to 65°F overnight.",
      "digital_probe": {
        "ph": "5.19",
        "ec_mScm": "0.09",
        "salt_mg_L": "45",
        "moisture_mScm": "30.00",
        "light": "98",
        "rh_percent": "63",
        "fertility_percent": "7.2",
        "soil_temp_f": "69.6"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Siberian Hardneck shows early sprout development with upright green tips just above the soil line. Leaf color is healthy and the planter soil is moderately moist with no compaction or crusting.",
      "actions": "Apply light watering in the morning to offset the warming day while avoiding waterlogging. Hold fertilizer and additional amendments until pH correction is underway.",
      "next_steps": "Recheck soil moisture later in the day and continue monitoring sprout height and color over the next 24–48 hours.",
      "q_and_a_summary": "Confirmed that future logs can be generated directly from photos and screenshots and that this workflow would continue to work.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Close view of Siberian Hardneck sprouts emerging from the soil surface.",
          "tags": "garlic, siberian-hardneck, sprouts, allium"
        }
      ]
    },
    {
      "date": "11/17/2025",
      "time": "9:01 AM",
      "conditions": "Mostly sunny with a high of 81°F dropping to 61°F overnight.",
      "digital_probe": {
        "ph": "4.92",
        "ec_mScm": "0.23",
        "salt_mg_L": "117",
        "moisture_mScm": "48.00",
        "light": "99",
        "rh_percent": "61",
        "fertility_percent": "12.0",
        "soil_temp_f": "60.8"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "Early garlic shoots are emerging with upright pale-green growth tips. Shoots appear healthy with no bending, discoloration, or tip burn and the soil is evenly moist after recent planting.",
      "actions": "Apply a top-dress of dolomitic or garden lime to the Siberian Hardneck section and the rest of the planter to begin raising the strongly acidic soil pH.",
      "next_steps": "Recheck pH and moisture within 24 hours and continue watching for additional shoots breaking the surface.",
      "q_and_a_summary": "Confirmed that early garlic shoots look healthy and stable for this stage.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Siberian Hardneck sprouts emerging from moist potting mix near the left label.",
          "tags": "garlic, siberian-hardneck, sprouts, alliums"
        }
      ]
    }
  ]
}