{
  "id": "mum_001",
  "status": "Active",
  "plant": "Yellow Chrysanthemum (Left)",
  "physical_location": "Loxahatchee, FL",
  "garden_location": "Firepit",
  "full_sun_start": "9:30 AM EST",
  "full_shade_start": "4:15 PM EST",
  "container": "Round pot, 2 gal, black",
  "soil_mix": "Original Nursery Mix",
  "origin_history": [
    "Found dying plant by a dumpster on December 7, 2025.",
    "Hard Pruned to 8\""
  ],
  "whats_been_logged": "The focus has been on reviving a severely stressed, discarded chrysanthemum through hard pruning, correcting extreme soil alkalinity, breaking up a dense surface root mat, and monitoring early shoot emergence as the plant begins recovery.",
  "current_stage": "Early Shoot Recovery",
  "current_state": "The plant is in early recovery after a hard prune, with multiple new shoots emerging along the stems and healthy green foliage beginning to return. The stems are firm with no signs of rot, and the surface soil shows a dense mat of fine roots typical of a root-bound chrysanthemum.",
  "timeline": [
    {
      "what_i_should_see": "Early Shoot Recovery",
      "date_range": "Dec 8 - Dec 22, 2025"
    },
    {
      "what_i_should_see": "Vegetative Refill and Canopy Rebuilding",
      "date_range": "Dec 23, 2025 - Jan 20, 2026"
    },
    {
      "what_i_should_see": "First post-rescue bud initiation",
      "date_range": "Jan 21 - Feb 15, 2026"
    }
  ],
  "journal": [
    {
      "date": "12/20/2025",
      "time": "7:38 AM",
      "conditions": "Sunny with a high of 82°F dropping to 66°F overnight.",
      "digital_probe": {
        "ph": "5.90",
        "ec_mScm": "0.19",
        "salt_mg_L": "99",
        "moisture_mScm": "60.00",
        "light": "87",
        "rh_percent": "67",
        "fertility_percent": "10",
        "soil_temp_f": "65.3"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The chrysanthemum is firmly in active bud development with numerous uniform buds across all stems. Buds are tight and well formed with some reddish or bronze blush on outer bracts, consistent with early-stage yellow chrysanthemum development under high light. Foliage remains turgid and stems are structurally sound.",
      "actions": "No watering today; soil moisture is adequate and watering would risk overnight saturation. No fertilization applied; fertility level supports bud expansion without forcing soft growth.",
      "next_steps": "Recheck probe readings at the next opportunity. Monitor buds for swelling and initial petal separation as flowering approaches. Continue current sun exposure and airflow.",
      "q_and_a_summary": "Confirmed that bud coloration is consistent with a single yellow chrysanthemum cultivar; early reddish tones are normal and will fade as petals emerge.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_001-20251220-02.jpeg",
          "caption": "Top-down view showing uniform bud distribution and strong canopy structure.",
          "tags": "chrysanthemum, buds, canopy"
        },
        {
          "file_name": "mum_001-20251220-03.jpeg",
          "caption": "Side view highlighting firm stems and synchronized bud development.",
          "tags": "chrysanthemum, buds, stems"
        },
        {
          "file_name": "mum_001-20251220-04.jpeg",
          "caption": "Close-up of immature bud showing normal reddish blush prior to yellow petal emergence.",
          "tags": "chrysanthemum, bud, color-development"
        },
        {
          "file_name": "mum_001-20251220-05.jpeg",
          "caption": "Close-up showing multiple compact buds at different nodes.",
          "tags": "chrysanthemum, buds, growth"
        },
        {
          "file_name": "mum_001-20251220-06.jpeg",
          "caption": "Detail view of foliage and buds under full sun conditions.",
          "tags": "chrysanthemum, foliage, buds"
        }
      ]
    },
    {
      "date": "12/19/2025",
      "time": "10:07 AM",
      "conditions": "Patchy fog before 8 AM, otherwise partly sunny with a high near 84°F dropping to around 61°F overnight.",
      "digital_probe": {
        "ph": "5.50",
        "ec_mScm": "0.18",
        "salt_mg_L": "94",
        "moisture_mScm": "55.00",
        "light": "99",
        "rh_percent": "70",
        "fertility_percent": "9.0",
        "soil_temp_f": "74.7"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The chrysanthemum shows strong continued recovery with sturdy, turgid foliage and many newly visible bud sites developing across multiple stems. Structure remains upright and stable, and bud clusters are becoming more defined, indicating active progression toward flowering.",
      "actions": "Do not water tonight as moisture remains adequate and nighttime watering would increase saturation risk. Do not fertilize today; nutrient levels are appropriate for bud development. Recheck moisture tomorrow morning and water only if the reading drops to 35.00 or lower.",
      "next_steps": "Recheck probe readings tomorrow morning. Monitor pH over the next few days to ensure it does not continue drifting downward. Watch bud clusters for uniform swelling and color development as flowering approaches.",
      "q_and_a_summary": "Discussed whether the new buds will all be the same color; explained they should bloom consistently yellow if this is a single cultivar, with minor early-bloom variation possible during recovery.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_001-20251219-02.jpeg",
          "caption": "Top-down view showing multiple developing bud clusters and healthy, turgid foliage across the pot.",
          "tags": "chrysanthemum, buds, canopy, recovery"
        },
        {
          "file_name": "mum_001-20251219-03.jpeg",
          "caption": "Side view highlighting upright stems, expanding leaves, and numerous newly forming buds along the stem tips.",
          "tags": "chrysanthemum, buds, stems, vegetative growth"
        }
      ]
    },
    {
      "date": "12/18/2025",
      "time": "12:43 PM",
      "conditions": "Partly sunny with a high of 83°F dropping to 67°F overnight.",
      "digital_probe": {
        "ph": "5.70",
        "ec_mScm": "0.20",
        "salt_mg_L": "101",
        "moisture_mScm": "58.00",
        "light": "99",
        "rh_percent": "55",
        "fertility_percent": "10.0",
        "soil_temp_f": "74.3"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The chrysanthemum shows clear advancement into vegetative refill with increased leaf size, paired leaf expansion on multiple stems, and well-defined but compact bud sites. Foliage remains healthy and upright following several hours of intermittent rain. Soil is evenly moist and settled with no signs of pooling or stress.",
      "actions": "Do not water today as soil moisture is sufficient from rainfall. Do not fertilize; nutrient availability is adequate and active. Leave soil undisturbed to allow pH and moisture to stabilize naturally.",
      "next_steps": "Recheck soil readings in 1–2 days after the soil equilibrates. Monitor pH for a natural return toward the mid-6 range. Continue observing bud behavior to ensure slow, controlled development.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_001-20251218-02.jpeg",
          "caption": "Top-down view showing increased leaf density and multiple compact bud sites after rainfall.",
          "tags": "chrysanthemum, canopy, buds, vegetative growth"
        },
        {
          "file_name": "mum_001-20251218-03.jpeg",
          "caption": "Side view highlighting paired leaf expansion and upright stems with no rain-related stress.",
          "tags": "chrysanthemum, leaves, stems, recovery"
        },
        {
          "file_name": "mum_001-20251218-04.jpeg",
          "caption": "Alternate angle showing evenly settled, moist soil and balanced regrowth across the pot.",
          "tags": "chrysanthemum, soil, structure, healthy-growth"
        }
      ]
    },
    {
      "date": "12/16/2025",
      "time": "11:36 AM",
      "conditions": "Mostly sunny with a high near 80°F dropping to around 65°F overnight.",
      "digital_probe": {
        "ph": "6.60",
        "ec_mScm": "0.13",
        "salt_mg_L": "68",
        "moisture_mScm": "55.00",
        "light": "99",
        "rh_percent": "52",
        "fertility_percent": "7.0",
        "soil_temp_f": "65.7"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The chrysanthemum continues active recovery with firm, upright stems and increasing leaf mass at multiple nodes. Bud sites are present but remain compact, which is appropriate for this stage. Surface soil showed wind-related crusting prior to loosening, but overall soil structure remains stable with no signs of stress or water imbalance.",
      "actions": "Do not water today as moisture is ideal and rainfall is expected. Do not fertilize; nutrient levels are well matched to the plant’s recovery stage. Avoid deep soil disturbance and maintain current placement.",
      "next_steps": "Allow rain to naturally rehydrate and settle the surface. Recheck soil moisture within 24–48 hours. Continue monitoring for paired leaf expansion as confirmation of vegetative refill progression.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_001-20251216-02.jpeg",
          "caption": "Top-down view showing expanding leaf mass and evenly distributed regrowth after wind exposure.",
          "tags": "chrysanthemum, recovery, canopy, leaves"
        },
        {
          "file_name": "mum_001-20251216-03.jpeg",
          "caption": "Side view highlighting upright stems, compact bud sites, and healthy leaf expansion.",
          "tags": "chrysanthemum, stems, buds, vegetative growth"
        },
        {
          "file_name": "mum_001-20251216-04.jpeg",
          "caption": "Alternate angle showing stable soil surface after light fluffing and balanced regrowth.",
          "tags": "chrysanthemum, soil, structure, recovery"
        }
      ]
    },
    {
      "date": "12/15/2025",
      "time": "10:02 AM",
      "conditions": "A 20 percent chance of showers and thunderstorms, partly sunny with a high of 81°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "6.60",
        "ec_mScm": "0.14",
        "salt_mg_L": "70",
        "moisture_mScm": "54.00",
        "light": "99",
        "rh_percent": "60",
        "fertility_percent": "7.0",
        "soil_temp_f": "68.7"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The chrysanthemum is actively rebuilding its canopy with multiple stems elongating and producing larger, well-formed leaves. Bud sites are present but remain juvenile, which is appropriate at this stage. Stems are firm and upright with no signs of wilt, stress, or disease, and soil structure appears stable and evenly settled.",
      "actions": "Do not water today as moisture is ideal and rain chances are sufficient. Do not fertilize; existing nutrient levels are appropriate for continued vegetative recovery. Leave soil undisturbed and maintain current placement.",
      "next_steps": "Recheck soil moisture in 24–48 hours after weather passes. Monitor for paired leaf expansion across multiple stems as confirmation of full vegetative refill. Continue observing bud behavior without intervention.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_001-20251215-02.jpeg",
          "caption": "Top-down view showing active canopy rebuild with multiple stems producing expanding leaves.",
          "tags": "chrysanthemum, recovery, canopy, new growth"
        },
        {
          "file_name": "mum_001-20251215-03.jpeg",
          "caption": "Angled side view highlighting upright stems, healthy internode spacing, and early bud sites.",
          "tags": "chrysanthemum, stems, buds, vegetative growth"
        },
        {
          "file_name": "mum_001-20251215-04.jpeg",
          "caption": "Alternate angle showing balanced regrowth across the pot and stable soil surface.",
          "tags": "chrysanthemum, structure, recovery, soil"
        }
      ]
    },
    {
      "date": "12/12/2025",
      "time": "1:03 PM",
      "conditions": "Mostly sunny with a high of 79°F dropping to 62°F overnight.",
      "digital_probe": {
        "ph": "7.3",
        "ec_mScm": "0.34",
        "salt_mg_L": "171",
        "moisture_mScm": "70.00",
        "light": "99",
        "rh_percent": "50",
        "fertility_percent": "19",
        "soil_temp_f": "71.1"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant shows healthy shoot recovery with some continued expansion and increased leaf definition. The stems remain firm, and the plant appears stable. There's even growth across the pot, but some areas at the base are still a bit slower to recover. Soil moisture is high, but no signs of stress yet.",
      "actions": "No watering required today. Avoid further fertilization due to adequate slow-release nutrients. Maintain current light exposure. Pot rotation is still advised for even growth distribution.",
      "next_steps": "Monitor moisture tomorrow morning. Watch for continued expansion and leaf development, particularly from the slower areas at the base. Maintain current care plan.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_001-20251212-02.jpeg",
          "caption": "Top-down view showing even recovery and new growth across the pot.",
          "tags": "chrysanthemum, recovery, new growth"
        },
        {
          "file_name": "mum_001-20251212-03.jpeg",
          "caption": "Side view highlighting thickening stems and improved foliage.",
          "tags": "chrysanthemum, stems, foliage"
        }
      ]
    },
    {
      "date": "12/11/2025",
      "time": "4:45 PM",
      "conditions": "Mostly Sunny with a high of 73°F dropping to 53°F overnight.",
      "digital_probe": {
        "ph": "6.5",
        "ec_mScm": "0.15",
        "salt_mg_L": "75",
        "moisture_percent": "45",
        "light_percent": "99",
        "rh_percent": "48",
        "fertility_percent": "8",
        "soil_temp_f": "69.3"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant continues strong early shoot recovery with thicker, more structured new growth across all stems. Leaf shape is becoming more defined, and growth is evenly distributed throughout the pot. Bud primordia are visible but not advancing, which is appropriate for this stage. Soil structure remains stable with no signs of compaction returning.",
      "actions": "No watering required as moisture levels are ideal. No fertilization applied; slow-release pellets remain active. Soil left undisturbed to allow continued root establishment. Pot rotated slightly for even light exposure.",
      "next_steps": "Continue daily visual monitoring. Recheck moisture tomorrow morning. Watch for paired leaf expansion on multiple shoots as the indicator of approaching transition into vegetative refill.",
      "q_and_a_summary": "Confirmed that current temperatures are ideal for chrysanthemum recovery and not a concern.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_001-20251211-02.jpeg",
          "caption": "Top-down view showing even early shoot recovery across the pot.",
          "tags": "chrysanthemum, recovery, new growth"
        },
        {
          "file_name": "mum_001-20251211-03.jpeg",
          "caption": "Side view highlighting thickening stems and emerging leaf structure.",
          "tags": "chrysanthemum, stems, foliage"
        },
        {
          "file_name": "mum_001-20251211-04.jpeg",
          "caption": "Alternate angle showing uniform growth and stable soil surface.",
          "tags": "chrysanthemum, structure, soil"
        },
        {
          "file_name": "mum_001-20251211-05.jpeg",
          "caption": "Close view of developing leaves and early bud sites.",
          "tags": "chrysanthemum, leaves, buds"
        },
        {
          "file_name": "mum_001-20251211-06.jpeg",
          "caption": "Full pot view showing balanced regrowth after pruning.",
          "tags": "chrysanthemum, pot, recovery"
        }
      ]
    },
    {
      "date": "12/10/2025",
      "time": "8:05 AM",
      "conditions": "Mostly Sunny with a high of 77°F dropping to 52°F overnight.",
      "digital_probe": {
        "ph": "6.40",
        "ec_mScm": "0.14",
        "salt_mg_L": "74",
        "moisture_mScm": "48.00",
        "light": "68",
        "rh_percent": "64",
        "fertility_percent": "7.0",
        "soil_temp_f": "63.5"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant shows strong early shoot recovery with multiple stems pushing new foliage and buds. Leaf color is brighter and more uniform than previous days, and the center crown is now activating with new shoots. The soil surface has improved structure from the loosened root layer and added potting mix, allowing deeper probe contact. No signs of wilt, rot, or fungal issues are present.",
      "actions": "Do not water today as moisture is ideal for cool conditions. Avoid fertilizing, since nutrient availability remains sufficient from the existing slow-release pellets. Leave the soil undisturbed to allow the root zone to stabilize. Rotate the pot slightly to promote even light exposure across emerging shoots.",
      "next_steps": "Recheck soil moisture tomorrow morning. Monitor new shoots for leaf-pair development, which will signal the transition toward vegetative refill. Expect noticeable canopy thickening over the next few days under the favorable cool and sunny weather pattern.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Morning probe reading showing balanced pH, moisture, and nutrient levels.",
          "tags": "chrysanthemum, probe, readings"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Top-down view showing active early shoot recovery and brightened foliage.",
          "tags": "chrysanthemum, new growth, recovery"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Side angle view with multiple stems producing new shoots and improved leaf color.",
          "tags": "chrysanthemum, stems, leaf growth"
        }
      ]
    },
    {
      "date": "12/9/2025",
      "time": "9:44 AM",
      "conditions": "Slight Chance T-storms then Showers Likely with a high of 83°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "5.57",
        "ec_mScm": "0.10",
        "salt_mg_L": "51",
        "moisture_mScm": "55.00",
        "light": "99",
        "rh_percent": "61",
        "fertility_percent": "5.0",
        "soil_temp_f": "68.9"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant shows active recovery with fresh shoots expanding along the stems and improved leaf color. The soil beneath the hardened surface layer contained dense roots and intact slow-release fertilizer pellets, which were exposed during loosening. Moisture distribution is now more even, and the overall structure appears healthier following the addition of fresh potting mix. No signs of rot or disease are visible.",
      "actions": "Leave the exposed slow-release pellets in place. Do not fertilize today, as nutrient levels remain adequate. Avoid further soil disturbance to allow roots to settle from the deep loosening. Do not water, since moisture is ideal and conditions are humid with rain likely.",
      "next_steps": "Recheck moisture tomorrow morning to confirm stable hydration. Monitor pH over the next several days as the loosened soil and existing pellets equilibrate. Watch for rapid shoot expansion and fuller leaf development as the plant continues its recovery.",
      "q_and_a_summary": "Confirmed that the metallic green balls uncovered in the soil are slow-release fertilizer pellets and are safe to leave in place.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Close-up of loosened soil showing slow-release fertilizer pellets and fine root mat.",
          "tags": "chrysanthemum, soil, fertilizer pellets, roots"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Top-down view of the recovering chrysanthemum showing new shoot growth after soil loosening.",
          "tags": "chrysanthemum, regrowth, shoots, pruning recovery"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Detailed view of emerging foliage and healthy green shoots developing along pruned stems.",
          "tags": "chrysanthemum, new growth, stems, foliage"
        }
      ]
    },
    {
      "date": "12/8/2025",
      "time": "12:43 PM",
      "conditions": "Slight Chance T-storms then Showers Likely with a high of 83°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "8.39",
        "ec_mScm": "0.08",
        "salt_mg_L": "42",
        "moisture_mScm": "47.00",
        "light": "89",
        "rh_percent": "53",
        "fertility_percent": "4.0",
        "soil_temp_f": "75.4"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant shows strong recovery potential with fresh green shoots emerging along the stems after a hard prune. The remaining foliage is soft but viable, and stems appear healthy with no signs of rot. The probe encountered difficulty entering the top layer due to a dense mat of surface roots, which is typical of a severely root-bound chrysanthemum. Soil pH is highly alkaline at 8.39, which may limit nutrient uptake.",
      "actions": "Gently loosen the top half inch of soil to break the dense root crust and improve air and water movement. Apply a light quarter-inch layer of Miracle-Gro Organic Potting Mix across the surface to introduce organic matter and help buffer pH downward. Do not water today, as moisture is ideal and expected rainfall will supply hydration.",
      "next_steps": "Recheck soil readings tomorrow after the rain to evaluate pH movement and moisture changes. Monitor new shoot development and avoid fertilizing until pH moves closer to neutral. Maintain bright light exposure but avoid harsh afternoon sun until fuller leaf regrowth occurs.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Before photo showing the chrysanthemum with extensive browning and spent blooms prior to pruning.",
          "tags": "chrysanthemum, before, browning, wilted blooms"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "After photo showing the plant post-pruning with visible new green shoots emerging.",
          "tags": "chrysanthemum, after, pruning, new growth"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "After photo highlighting the remaining stems and early shoot development from the crown.",
          "tags": "chrysanthemum, after, regrowth, stems"
        }
      ]
    }
  ]
}