{
  "id": "mum_002",
  "status": "Active",
  "plant": "Yellow Chrysanthemum (Right)",
  "physical_location": "Loxahatchee, FL",
  "garden_location": "Firepit",
  "full_sun_start": "9:30 AM EST",
  "full_shade_start": "4:15 PM EST",
  "container": "Round pot, 2 gal, black",
  "soil_mix": "Original Nursery Mix",
  "origin_history": [
    "Found dying plant by a dumpster on December 7, 2025.",
    "Hard Pruned to 8\""
  ],
  "whats_been_logged": "The focus has been on reviving a severely stressed, discarded chrysanthemum through hard pruning, correcting extreme soil alkalinity, breaking up a dense surface root mat, and monitoring early shoot emergence as the plant begins recovery.",
  "current_stage": "Early shoot recovery",
  "current_state": "The plant is in early recovery after a hard prune, with multiple new shoots emerging along the stems and healthy green foliage beginning to return. The stems are firm with no signs of rot, and the surface soil shows a dense mat of fine roots typical of a root-bound chrysanthemum.",
  "timeline": [
    {
      "what_i_should_see": "Early shoot recovery",
      "date_range": "Dec 8 - Dec 22, 2025"
    },
    {
      "what_i_should_see": "Vegetative refill and canopy rebuilding",
      "date_range": "Dec 23, 2025 - Jan 20, 2026"
    },
    {
      "what_i_should_see": "First post-rescue bud initiation",
      "date_range": "Jan 21 - Feb 15, 2026"
    }
  ],
  "journal": [
    {
      "date": "12/25/2025",
      "time": "12:21 PM",
      "conditions": "Sunny with a high of 80°F dropping to 62°F overnight.",
      "digital_probe": {
        "ph": "5.80",
        "ec_mScm": "0.24",
        "salt_mg_L": "124",
        "moisture_mScm": "80.00",
        "light": "94",
        "rh_percent": "52",
        "fertility_percent": "13.0",
        "soil_temp_f": "70.5"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The chrysanthemum is actively blooming with multiple open flowers and many buds at different stages across the canopy. Foliage is healthy green and stems appear firm with no visible wilting. Soil appears very moist, consistent with the high moisture reading.",
      "actions": "Do not water today due to very high moisture. Do not fertilize today. Deadhead spent blooms by snipping flower heads above the next set of leaves to redirect energy into unopened buds.",
      "next_steps": "Recheck probe readings tomorrow or the following morning. Do not water until moisture drops below 35 mS/cm. If moisture drops and the plant continues heavy blooming, plan a light feeding at the next watering.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_002-20251225-02.jpeg",
          "caption": "Overhead view showing active blooming with multiple open flowers and many developing buds across the canopy.",
          "tags": "chrysanthemum, overhead, buds, bloom, canopy"
        },
        {
          "file_name": "mum_002-20251225-03.jpeg",
          "caption": "Side view showing firm stems, dense bud formation, and several open flowers above the pot rim.",
          "tags": "chrysanthemum, side-view, stems, buds, bloom"
        },
        {
          "file_name": "mum_002-20251225-04.jpeg",
          "caption": "Close view highlighting open blooms and nearby buds preparing to open, with healthy green foliage and no visible wilting.",
          "tags": "chrysanthemum, close-up, flowers, buds, foliage"
        }
      ]
    },
    {
      "date": "12/20/2025",
      "time": "7:39 AM",
      "conditions": "Sunny with a high of 82°F dropping to 66°F overnight.",
      "digital_probe": {
        "ph": "5.40",
        "ec_mScm": "0.26",
        "salt_mg_L": "132",
        "moisture_mScm": "70.00",
        "light": "79",
        "rh_percent": "66",
        "fertility_percent": "14.0",
        "soil_temp_f": "65.3"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant shows strong, uniform bud swelling across most stems with firm structure and healthy foliage. Reddish pigmentation observed on outer bud bracts is consistent with normal chrysanthemum pre-bloom coloration and not indicative of final flower color. Soil moisture continues to decline gradually following prior rainfall.",
      "actions": "No watering and no fertilization today. Allow continued dry-down under sunny conditions.",
      "next_steps": "Take the next probe reading on the following day to determine whether moderate watering is appropriate. Monitor buds for first petal emergence.",
      "q_and_a_summary": "Confirmed that reddish tones seen on bud bracts are normal protective pigmentation; all blooms will open yellow.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_002-20251220-02.jpeg",
          "caption": "Overhead view showing evenly distributed bud swell across the canopy.",
          "tags": "chrysanthemum, buds, canopy"
        },
        {
          "file_name": "mum_002-20251220-03.jpeg",
          "caption": "Side view highlighting firm stems and multiple buds nearing first crack.",
          "tags": "chrysanthemum, buds, stems"
        },
        {
          "file_name": "mum_002-20251220-04.jpeg",
          "caption": "Close-up of developing buds showing normal reddish bract pigmentation prior to yellow petal emergence.",
          "tags": "chrysanthemum, buds, pre-bloom"
        },
        {
          "file_name": "mum_002-20251220-05.jpeg",
          "caption": "Close-up showing healthy foliage and intact bud structure near the container edge.",
          "tags": "chrysanthemum, foliage, buds"
        }
      ]
    },
    {
      "date": "12/19/2025",
      "time": "10:08 AM",
      "conditions": "Patchy fog before 8 AM, otherwise partly sunny with a high near 84°F dropping to around 61°F overnight.",
      "digital_probe": {
        "ph": "5.50",
        "ec_mScm": "0.36",
        "salt_mg_L": "180",
        "moisture_mScm": "90.00",
        "light": "99",
        "rh_percent": "69",
        "fertility_percent": "21.0",
        "soil_temp_f": "73.2"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant shows widespread and coordinated bud initiation across nearly all active stems, with firm structure, healthy green foliage, and no signs of stress despite elevated moisture and nutrient levels from recent rainfall. Soil remains saturated, and the canopy is beginning to visually thicken as the plant transitions toward bloom.",
      "actions": "Do not water today or tonight. Do not fertilize. Allow soil to dry naturally following recent rain and elevated moisture levels.",
      "next_steps": "Recheck moisture late tomorrow morning or early afternoon. Plan selective watering only once moisture drops below 35–40 mS/cm. Monitor for bud swelling and early color development.",
      "q_and_a_summary": "Confirmed that all buds on this chrysanthemum will bloom the same color, as chrysanthemums do not produce mixed-color flowers on a single plant.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_002-20251219-02.jpeg",
          "caption": "Overhead view showing dense, evenly distributed bud clusters forming across the canopy.",
          "tags": "chrysanthemum, buds, canopy, bloom-initiation"
        },
        {
          "file_name": "mum_002-20251219-03.jpeg",
          "caption": "Side view highlighting firm stems, short internodes, and multiple developing buds at stem tips and nodes.",
          "tags": "chrysanthemum, buds, stems, structure"
        }
      ]
    },
    {
      "date": "12/18/2025",
      "time": "12:44 PM",
      "conditions": "Partly sunny with a high of 83°F dropping to 67°F overnight.",
      "digital_probe": {
        "ph": "5.50",
        "ec_mScm": "0.39",
        "salt_mg_L": "198",
        "moisture_mScm": "70.00",
        "light": "89",
        "rh_percent": "55",
        "fertility_percent": "23.0",
        "soil_temp_f": "72.9"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant remains structurally sound with firm stems and intact bud clusters despite a recent pot tip-over and significant rainfall earlier today. Foliage is turgid and green with no signs of wilting, breakage, or nutrient burn. Soil moisture and nutrient readings are elevated due to rain mobilizing existing nutrients, not over-application.",
      "actions": "Do not water today. Do not apply fertilizer. Leave the plant undisturbed and allow the soil to dry naturally.",
      "next_steps": "Allow soil to dry over the next 2–3 days. Recheck probe readings once moisture drops below 35 mS/cm. Monitor for continued bud swelling and canopy fill.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_002-20251218-02.jpeg",
          "caption": "Overhead view showing intact bud clusters and stable plant structure after rainfall.",
          "tags": "chrysanthemum, buds, canopy, recovery"
        },
        {
          "file_name": "mum_002-20251218-03.jpeg",
          "caption": "Side view highlighting firm stems and undisturbed bud development following a pot tip-over.",
          "tags": "chrysanthemum, stems, buds, resilience"
        },
        {
          "file_name": "mum_002-20251218-04.jpeg",
          "caption": "Angled view showing healthy foliage and settled soil after heavy rain.",
          "tags": "chrysanthemum, foliage, soil, stability"
        }
      ]
    },
    {
      "date": "12/16/2025",
      "time": "11:37 AM",
      "conditions": "Mostly sunny with a high near 80°F dropping to around 65°F overnight.",
      "digital_probe": {
        "ph": "6.00",
        "ec_mScm": "0.18",
        "salt_mg_L": "94",
        "moisture_mScm": "47.00",
        "light": "99",
        "rh_percent": "52",
        "fertility_percent": "9.0",
        "soil_temp_f": "62.1"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant continues strong post-prune recovery with firm stems, evenly distributed regrowth, and expanding bud clusters at stem tips and nodes. Leaf color remains healthy green with no signs of nutrient burn or wilting. The soil surface had crusted from wind exposure but was loosened successfully, improving aeration and probe contact.",
      "actions": "Do not water today, as moisture is adequate and rainfall is expected. Do not apply fertilizer. Leave the soil surface fluffed to allow rain to settle it naturally.",
      "next_steps": "Recheck probe readings after rainfall has passed and the soil has settled. Monitor for increased bud swelling and lateral leaf expansion over the next several days.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_002-20251216-02.jpeg",
          "caption": "Overhead view showing evenly distributed regrowth and multiple developing bud clusters across the plant.",
          "tags": "chrysanthemum, buds, regrowth, canopy"
        },
        {
          "file_name": "mum_002-20251216-03.jpeg",
          "caption": "Side view highlighting firm stems, short internodes, and active bud development following soil loosening.",
          "tags": "chrysanthemum, stems, buds, recovery"
        },
        {
          "file_name": "mum_002-20251216-04.jpeg",
          "caption": "Angled view showing healthy foliage, upright posture, and newly aerated soil surface.",
          "tags": "chrysanthemum, foliage, soil, recovery"
        }
      ]
    },
    {
      "date": "12/15/2025",
      "time": "10:03 AM",
      "conditions": "A 20 percent chance of showers and thunderstorms, partly sunny with a high of 81°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "5.80",
        "ec_mScm": "0.08",
        "salt_mg_L": "42",
        "moisture_mScm": "29.00",
        "light": "99",
        "rh_percent": "56",
        "fertility_percent": "4.0",
        "soil_temp_f": "65.5"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant shows strong, even regrowth across all pruned stems with firm structure and increasing bud cluster formation at stem tips and nodes. Leaf color is healthy green with no signs of wilting, burn, or disease. The canopy remains open but is filling in steadily, and the plant appears resilient despite windy conditions.",
      "actions": "Do not water today, as soil moisture is ideal and rain chances are present. Do not fertilize yet. Maintain current placement and allow wind exposure to pass naturally.",
      "next_steps": "Recheck moisture in 1–2 days once winds subside. Plan a light fertilizer application at the next watering if moisture drops below 25 mS/cm. Monitor for continued canopy fill and bud enlargement.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_002-20251215-02.jpeg",
          "caption": "Overhead view showing evenly distributed regrowth and multiple developing bud clusters across the canopy.",
          "tags": "chrysanthemum, regrowth, buds, canopy"
        },
        {
          "file_name": "mum_002-20251215-03.jpeg",
          "caption": "Side view highlighting firm stems, short internodes, and active bud formation following hard pruning.",
          "tags": "chrysanthemum, stems, buds, recovery"
        },
        {
          "file_name": "mum_002-20251215-04.jpeg",
          "caption": "Angled view showing overall plant posture and healthy foliage with no signs of stress or collapse.",
          "tags": "chrysanthemum, structure, foliage, recovery"
        }
      ]
    },
    {
      "date": "12/12/2025",
      "time": "1:03 PM",
      "conditions": "Mostly sunny with a high of 79°F dropping to 62°F overnight.",
      "digital_probe": {
        "ph": "6.90",
        "ec_mScm": "0.10",
        "salt_mg_L": "53",
        "moisture_mScm": "54.00",
        "light": "99",
        "rh_percent": "49",
        "fertility_percent": "5.0",
        "soil_temp_f": "67.6"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant continues its recovery, with new shoots and green foliage filling out the canopy. The soil is slightly dry on the surface, but this is likely due to the previous loosening and not an issue with moisture. The stems are firm, with no signs of stress or rot.",
      "actions": "Water gently to ensure the soil stays well hydrated, but avoid over-watering. Ensure good probe contact with the soil when measuring.",
      "next_steps": "Monitor moisture levels over the next few days. Prepare to fertilize in a couple of days when the soil conditions stabilize.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_002-20251212-02.jpeg",
          "caption": "Top view of the chrysanthemum showing foliage expansion and new growth.",
          "tags": "chrysanthemum, regrowth, foliage"
        },
        {
          "file_name": "mum_002-20251212-03.jpeg",
          "caption": "Side view of the plant, highlighting firm stems and emerging shoots.",
          "tags": "chrysanthemum, stems, shoots, recovery"
        }
      ]
    },
    {
      "date": "12/11/2025",
      "time": "4:46 PM",
      "conditions": "Mostly Sunny with a high of 73°F dropping to 53°F overnight. Tonight: Clear. Tomorrow: Sunny with a high of 78°F.",
      "digital_probe": {
        "ph": "6.30",
        "ec_mScm": "0.02",
        "salt_mg_L": "10",
        "moisture_percent": "0",
        "light_percent": "99",
        "rh_percent": "48",
        "fertility_percent": "1",
        "soil_temp_f": "73.4"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant continues strong post-rescue recovery with firm, upright stems and ongoing leaf expansion across the canopy. Multiple bud clusters are clearly forming at stem nodes. No wilting, collapse, or discoloration is present. The soil surface appears slightly dry but structurally healthy; the 0% moisture reading is attributed to probe contact with an air pocket following recent soil loosening rather than true root-zone dryness. Soil pH remains stable and ideal.",
      "actions": "Watered gently to re-seat loosened soil around the root zone and improve probe contact, stopping once light drainage began. No lime applied. No fertilizer applied today.",
      "next_steps": "Allow soil to settle overnight after watering. Plan to fertilize within the next 24 hours now that pH is stable and active bud formation is underway. Recheck probe readings tomorrow morning after watering has equilibrated.",
      "q_and_a_summary": "Confirmed that current temperatures are not a concern; cool nights in the low 50s are beneficial for chrysanthemums and support healthy growth and future bud development.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "mum_002-20251211-02.jpeg",
          "caption": "Top-down view showing expanded foliage, active crown growth, and improved soil structure.",
          "tags": "chrysanthemum, regrowth, canopy"
        },
        {
          "file_name": "mum_002-20251211-03.jpeg",
          "caption": "Side view highlighting firm stems and multiple forming bud clusters at the nodes.",
          "tags": "chrysanthemum, buds, stems"
        },
        {
          "file_name": "mum_002-20251211-04.jpeg",
          "caption": "Angled view showing evenly distributed new growth following earlier hard pruning.",
          "tags": "chrysanthemum, pruning, recovery"
        },
        {
          "file_name": "mum_002-20251211-05.jpeg",
          "caption": "Close view of lower growth and soil surface after gentle watering to re-seat loosened media.",
          "tags": "chrysanthemum, soil, roots"
        }
      ]
    },
    {
      "date": "12/10/2025",
      "time": "8:07 AM",
      "conditions": "Mostly Sunny with a high of 77°F dropping to 52°F overnight.",
      "digital_probe": {
        "ph": "6.30",
        "ec_mScm": "0.07",
        "salt_mg_L": "37",
        "moisture_mScm": "36.00",
        "light": "97",
        "rh_percent": "66",
        "fertility_percent": "4.0",
        "soil_temp_f": "64.2"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant shows noticeable fresh leaf expansion compared to the previous day, with firm stems and healthy green new growth emerging along the pruned framework. Bud clusters are present and beginning to swell. Soil texture is markedly improved following earlier loosening and the addition of fresh potting mix, with even hydration and good aeration. The soil pH now falls within an ideal chrysanthemum range, and moisture has settled into a healthy morning dry-down.",
      "actions": "Do not water today. Do not apply any lime, as the current pH is ideal. Begin preparing to fertilize in 1–2 days using 2 teaspoons Purived 4-5-5 mixed into 2 cups of water, to be applied once moisture conditions are appropriate.",
      "next_steps": "Recheck moisture levels tomorrow morning. If moisture remains above 25 mS/cm, plan to fertilize tomorrow. Monitor for accelerated leaf expansion over the next several days as the plant moves through active vegetative refill.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Top view of the chrysanthemum showing expanding foliage and improved soil texture following earlier soil loosening.",
          "tags": "chrysanthemum, foliage, regrowth"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Side-angle view highlighting swelling bud clusters and firm green stems after the hard prune.",
          "tags": "chrysanthemum, buds, stems"
        }
      ]
    },
    {
      "date": "12/9/2025",
      "time": "9:39 AM",
      "conditions": "Slight Chance T-storms then Showers Likely with a high of 83°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "4.69",
        "ec_mScm": "0.08",
        "salt_mg_L": "41",
        "moisture_mScm": "55.00",
        "light": "99",
        "rh_percent": "62",
        "fertility_percent": "4.0",
        "soil_temp_f": "68.7"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The soil surface shows a dense mat of fine roots typical of a root-bound chrysanthemum, and loosening the top layer has greatly improved aeration. Several slow-release fertilizer prills are visible within the soil, consistent with the original nursery media. The plant exhibits fresh, bright green new growth along stems and at the crown, with stems remaining firm and upright following the prior hard prune. Moisture is ideal, and pH has begun to rise slightly following soil loosening and the addition of fresh potting mix, even without any lime applied.",
      "actions": "Do not apply lime today, as the pH is already moving upward after soil loosening and the addition of fresh potting mix. Hold off on fertilizing until pH improves further. Lightly stabilize the loosened topsoil by gently firming the top half inch without compressing it.",
      "next_steps": "Recheck probe readings tomorrow morning. Expect pH to continue increasing gradually over the next several days. Plan for a light fertilizer application in 5–7 days once pH approaches the mid-5 range. Monitor for continued leaf expansion and fresh shoot growth.",
      "q_and_a_summary": "Confirmed that the metallic green balls in the soil are slow-release fertilizer prills. Explained the dense root mat as typical of heavily root-bound nursery chrysanthemums and affirmed that loosening the soil and adding potting mix were beneficial.",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Close-up of the soil showing loosened structure, fine roots, perlite, and visible slow-release fertilizer prills.",
          "tags": "chrysanthemum, soil, fertilizer, roots"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Top view of the pruned plant showing emerging leaf clusters and improved soil aeration.",
          "tags": "chrysanthemum, pruning, regrowth"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Side view showing healthy green shoots developing along the stems after soil loosening.",
          "tags": "chrysanthemum, shoots, regrowth"
        }
      ]
    },
    {
      "date": "12/8/2025",
      "time": "12:44 PM",
      "conditions": "Slight Chance T-storms then Showers Likely with a high of 83°F dropping to 63°F overnight.",
      "digital_probe": {
        "ph": "4.37",
        "ec_mScm": "0.11",
        "salt_mg_L": "57",
        "moisture_mScm": "55.00",
        "light": "99",
        "rh_percent": "60",
        "fertility_percent": "5.5",
        "soil_temp_f": "76.6"
      },
      "analog_probe": {
        "fertility": "",
        "moisture": "",
        "ph": ""
      },
      "observations": "The plant shows clear signs of having passed its bloom cycle, with spent flowers and browned petals common for chrysanthemums at this stage. After pruning, the plant structure appears clean with firm stems and emerging new leaf buds. The soil surface is densely matted with old feeder roots typical of a root-bound nursery mum, making probe insertion difficult. Probe readings indicate strongly acidic soil that could impede nutrient uptake despite early signs of rebound.",
      "actions": "Apply 1 tablespoon of dolomite lime evenly across the soil surface to begin correcting severe acidity if lime is available. Avoid watering immediately afterward in favor of allowing rainfall or a later light watering to draw the amendment into the soil. Hold off on applying fertilizer until pH begins to improve.",
      "next_steps": "Recheck probe readings in 24–48 hours after natural rainfall or a light watering. Begin light fertilization in 5–7 days once pH has risen toward the chrysanthemum-preferred range. Monitor for fresh green growth at leaf tips as a sign of recovery, and avoid watering unless moisture drops below 25 mS/cm.",
      "q_and_a_summary": "",
      "follow_up": [],
      "photos": [
        {
          "file_name": "<<put filename here>>",
          "caption": "Original plant condition showing dense masses of spent yellow blooms and heavily declined flower heads before pruning.",
          "tags": "chrysanthemum, flowers, decline"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Top-down view of the plant after a hard prune, showing multiple cut stems and emerging new buds.",
          "tags": "chrysanthemum, pruning, crown"
        },
        {
          "file_name": "<<put filename here>>",
          "caption": "Side view of the pruned chrysanthemum displaying the remaining stem framework and early green regrowth.",
          "tags": "chrysanthemum, stems, regrowth"
        }
      ]
    }
  ]
}